# -*- mode: ruby -*-

tap 'AdoptOpenJDK/openjdk'
tap 'aquasecurity/trivy'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'itchyny/tap'
tap 'mackerelio/mackerel-agent'
tap 'scalacenter/bloop'

brew 'ansible'
brew 'ansible-lint'
brew 'aquasecurity/trivy/trivy'
brew 'assh'
brew 'autoconf'
brew 'awscli'
brew 'awslogs'
brew 'azure-cli'
brew 'bash'
# brew 'chromedriver'
# brew 'clojurescript'
# brew 'closure-compiler'
brew 'coreutils'
brew 'cpanminus'
brew 'ctags'
brew 'direnv'
brew 'emacs'
brew 'envchain'
brew 'fswatch'
brew 'fzy'
brew 'gh'
brew 'ghc'
brew 'git'
brew 'git-now'
brew 'gpg'
brew 'hadolint'
brew 'hlint'
brew 'imageoptim-cli'
# brew 'istioctl'
brew 'itchyny/tap/base58'
brew 'jasper', link: true # PlantUML JPEG2000
brew 'jq'
brew 'krew'
brew 'kustomize'
brew 'libav' # youtube-dl
brew 'mackerelio/mackerel-agent/mackerel-agent', restart_service: true
brew 'mackerelio/mackerel-agent/mkr'
brew 'mas'
brew 'mkcert'
brew 'noti'
brew 'nss' # mkcert Firefox
brew 'openapi-generator'
brew 'peco'
brew 'plantuml'
brew 'ponyc'
brew 'postgresql@9.6', restart_service: true
brew 'pstree'
brew 'redis', restart_service: true
brew 'rlwrap'
brew 'sbt'
brew 'scalacenter/bloop/bloop', restart_service: true
brew 'shellcheck'
brew 'sl'
brew 'speedtest-cli'
brew 'sshuttle'
brew 'stern'
brew 'the_silver_searcher'
# brew 'terraform'
brew 'topgrade'
brew 'tree'
brew 'v8@3.15' # for therubyracer on Ruby 2.6.3
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'youtube-dl'
brew 'zsh'

cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
cask 'adoptopenjdk13'
# cask 'android-file-transfer'
# cask 'android-ndk'
# cask 'android-sdk'
cask 'dash'
cask 'discord'
cask 'dynamodb-local'
cask 'firefox'
# cask 'fontforge'
cask 'gfortran' # scipy
cask 'gimp'
cask 'google-cloud-sdk'
cask 'imageoptim'
# cask 'inkscape'
cask 'karabiner-elements'
cask 'notion'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'visualvm'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'

# mas 'LINE', id: 539883307
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Trello', id: 1278508951
