# -*- mode: ruby -*-

tap 'aws/tap'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'itchyny/tap'
tap 'mackerelio/mackerel-agent'
tap 'scalacenter/bloop'

brew 'act'
brew 'actionlint'
brew 'alp'
brew 'ansible'
brew 'ansible-lint'
brew 'aqua'
brew 'asdf'
brew 'autoconf'
brew 'awscli'
brew 'awslogs'
brew 'azure-cli'
brew 'bash'
brew 'Songmu/tap/blogsync'
brew 'borkdude/brew/clj-kondo'
# brew 'chromedriver'
brew 'container-structure-test'
brew 'coreutils'
brew 'cpanminus'
brew 'ctags'
brew 'dash'
brew 'direnv'
brew 'dotnet'
brew 'envchain'
brew 'equinix-labs/otel-cli/otel-cli'
brew 'ffmpeg'
brew 'flac'
brew 'fop' # Erlang/OTP
brew 'fswatch'
brew 'fzy'
brew 'gfortran' # scipy
brew 'gh'
brew 'ghalint'
brew 'ghc'
brew 'git'
brew 'git-lfs'
brew 'git-now'
brew 'git-secrets'
brew 'git-subrepo'
brew 'gnuplot'
brew 'goimports'
brew 'gpg'
brew 'hadolint'
brew 'huggingface-cli'
brew 'istioctl'
brew 'itchyny/tap/base58'
brew 'jasper', link: true # PlantUML JPEG2000
brew 'jq'
brew 'jsonnet'
brew 'kayac/tap/ecspresso'
brew 'krew'
brew 'kubeconform'
brew 'kustomize'
brew 'leiningen'
# brew 'libav' # youtube-dl
brew 'libxslt' # Erlang/OTP
brew 'libyaml' # Ruby
brew 'mackerelio/mackerel-agent/mackerel-agent', restart_service: true
brew 'mackerelio/mackerel-agent/mkr'
brew 'mas'
brew 'maven'
brew 'mkcert'
brew 'mono'
brew 'mysql', link: true
brew 'net-snmp'
brew 'nginx'
brew 'noti'
brew 'nss' # mkcert Firefox
brew 'nuget'
brew 'openapi-generator'
brew 'pass'
brew 'pass-otp'
brew 'peco'
brew 'percona-toolkit'
brew 'pinact'
brew 'pipenv'
brew 'plantuml'
brew 'postgresql@14', link: true, restart_service: true
brew 'pstree'
brew 'qemu'
brew 'redis', restart_service: true
brew 'ripgrep'
brew 'rlwrap'
brew 'sbt'
brew 'scalacenter/bloop/bloop'
brew 'shellcheck'
brew 'skaffold'
brew 'sl'
brew 'speedtest-cli'
brew 'sshuttle'
brew 'stern'
brew 'tbls'
brew 'tcl-tk'
brew 'terraform-docs'
brew 'tflint'
brew 'the_silver_searcher'
brew 'topgrade'
brew 'tree'
# brew 'v8@3.15' # for therubyracer on Ruby 2.6.3
brew 'uv'
brew 'vim'
brew 'vips' # for CND dreamkast
brew 'watch'
brew 'wget'
brew 'wireshark'
brew 'wxwidgets' # Erlang/OTP
brew 'yamllint'
# brew 'youtube-dl'
brew 'zizmor'
brew 'zsh'
brew 'zstd' # for CND dreamkast

cask '1password-cli'
cask 'cljstyle'
cask 'discord'
cask 'dynamodb-local'
cask 'firefox'
cask 'gcloud-cli'
cask 'gimp'
cask 'github'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'notion'
cask 'obs'
cask 'tunnelblick' # AWS Client VPN
cask 'vagrant'
cask 'virtualbox'
# brew 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'visualvm'
cask 'vlc'
cask 'xquartz'

mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
mas 'Swift Playground', id: 1496833156
mas 'The Unarchiver', id: 425424353
mas 'Windows App', id: 1295203466
