# -*- mode: ruby -*-

tap 'AdoptOpenJDK/openjdk'
tap 'aws/tap'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'itchyny/tap'
tap 'mackerelio/mackerel-agent'
tap 'scalacenter/bloop'

brew 'act'
brew 'actionlint'
brew 'alp'
brew 'ansible'
brew 'ansible-lint'
brew 'asdf'
brew 'autoconf'
brew 'awscli'
brew 'awslogs'
brew 'azure-cli'
brew 'bash'
brew 'borkdude/brew/clj-kondo'
# brew 'chromedriver'
brew 'container-structure-test'
brew 'coreutils'
brew 'cpanminus'
brew 'ctags'
brew 'direnv'
brew 'dotnet'
brew 'emacs'
brew 'envchain'
brew 'kayac/tap/ecspresso'
brew 'flac'
brew 'fop' # Erlang/OTP
brew 'fswatch'
brew 'fzy'
brew 'gh'
brew 'ghc'
brew 'git'
brew 'git-lfs'
brew 'git-now'
brew 'gnuplot'
brew 'gpg'
brew 'hadolint'
brew 'imageoptim-cli'
brew 'istioctl'
brew 'itchyny/tap/base58'
brew 'jasper', link: true # PlantUML JPEG2000
brew 'jq'
brew 'jsonnet'
brew 'k1LoW/tap/tbls'
brew 'krew'
brew 'kubeconform'
brew 'kustomize'
brew 'leiningen'
brew 'libav' # youtube-dl
brew 'libxslt' # Erlang/OTP
brew 'libyaml' # Ruby
brew 'mackerelio/mackerel-agent/mackerel-agent', restart_service: true
brew 'mackerelio/mackerel-agent/mkr'
brew 'mas'
brew 'maven'
brew 'mkcert'
brew 'mono'
brew 'mysql-client', link: true
brew 'nginx'
brew 'noti'
brew 'nss' # mkcert Firefox
brew 'nuget'
brew 'openapi-generator'
brew 'pass'
brew 'pass-otp'
brew 'peco'
brew 'percona-toolkit'
brew 'plantuml'
brew 'postgresql@12', link: true, restart_service: true
brew 'pstree'
brew 'redis', restart_service: true
brew 'rlwrap'
brew 'sbt'
brew 'scalacenter/bloop/bloop', restart_service: true
brew 'shellcheck'
brew 'skaffold'
brew 'sl'
brew 'speedtest-cli'
brew 'sshuttle'
brew 'stern'
brew 'tflint'
brew 'the_silver_searcher'
brew 'topgrade'
brew 'tree'
brew 'v8@3.15' # for therubyracer on Ruby 2.6.3
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wxwidgets' # Erlang/OTP
brew 'yamllint'
brew 'youtube-dl'
brew 'zsh'

cask 'adoptopenjdk11'
cask 'adoptopenjdk16'
# cask 'android-file-transfer'
# cask 'android-ndk'
# cask 'android-sdk'
cask 'cljstyle'
cask 'dash'
cask 'discord'
cask 'dynamodb-local'
cask 'firefox'
# cask 'fontforge'
cask 'gfortran' # scipy
cask 'gimp'
cask 'github'
cask 'google-cloud-sdk'
cask 'hyper'
cask 'imageoptim'
# cask 'inkscape'
cask 'karabiner-elements'
cask 'notion'
cask 'obs'
cask 'tunnelblick' # AWS Client VPN
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'visualvm'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'

mas 'Kindle', id: 405399194
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
