tap 'caskroom/cask'
tap 'joshuaclayton/formulae'
tap 'homebrew/bundle'

brew 'ansible'
brew 'ansible-lint'
brew 'chromedriver'
brew 'crystal-lang'
brew 'digdag'
brew 'direnv'
brew 'emacs'
brew 'erlang'
brew 'fzy'
brew 'ghc'
brew 'haskell-stack'
brew 'heroku'
brew 'hexedit'
brew 'hub'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libav'
brew 'leiningen'
brew 'mas'
brew 'mycli'
brew 'node'
brew 'noti'
brew 'peco'
brew 'p7zip'
brew 'plantuml'
brew 'shellcheck'
brew 'sl'
brew 'the_silver_searcher'
brew 'unused'
brew 'vim'
brew 'watch'
brew 'wine'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

cask 'android-file-transfer'
cask 'android-ndk'
cask 'android-sdk'
cask 'dash'
cask 'gimp'
cask 'inkscape'
cask 'caskroom/versions/java8'
# cask 'java'
cask 'vlc'
cask 'xquartz'

mas 'Evernote', id: 406056744
mas 'Slack', id: 803453959
