tap 'homebrew/bundle'
tap 'caskroom/cask'
brew 'ansible'
brew 'ansible-lint'
brew 'crystal-lang'
brew 'direnv'
brew 'emacs'
brew 'erlang'
brew 'ffmpeg'
brew 'haskell-stack'
brew 'heroku'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'peco'
brew 'shellcheck'
brew 'sl'
brew 'the_silver_searcher'
brew 'vim'
brew 'youtube-dl'
brew 'zsh'
cask 'gimp'
mas 'Evernote', id: 406056744
mas 'Slack', id: 803453959
